# BentFabricSheetTooLongBendingProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricSheetFailures..::..BentFabricSheetTooLongBendingProfile Property
BuiltInFailures..::..FabricSheetFailures Class See Also
---
The bent edge is shorter than the bend profile for this fabric sheet type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BentFabricSheetTooLongBendingProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BentFabricSheetTooLongBendingProfile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BentFabricSheetTooLongBendingProfile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricSheetFailures Class
Autodesk.Revit.DB Namespace